# **Basic Pandas**

In [56]:
import pandas as pd

In [57]:
# pd.DataFrame()
# pd.pivot_table

In [58]:
# create dataframe from scratch

raw_data = {
    "name": ["Toy", "Joe", "Marry", "John", "Anna"],
    "age": [33, 25, 20, 22, 31],
    "Gender": ["M", "M" ,"F", "M", "F"]
}

df = pd.DataFrame(raw_data)
df

,name,age,Gender
0,Toy,33,M
1,Joe,25,M
2,Marry,20,F
3,John,22,M
4,Anna,31,F

In [59]:
# creat a new column
df["city"] = "London" # ถ้าใส่ไปตัวเดียวแบบนี้ ทุกแถวจะเป็น london หมดเลย
df

,name,age,Gender,city
0,Toy,33,M,London
1,Joe,25,M,London
2,Marry,20,F,London
3,John,22,M,London
4,Anna,31,F,London

In [60]:
df["city"] = ["London", "London", "London", "Manchester", "Liverpool"] # กรณีที่ไม่ได้อยู่ในเมืองเดียวกันทุกคน
df

,name,age,Gender,city
0,Toy,33,M,London
1,Joe,25,M,London
2,Marry,20,F,London
3,John,22,M,Manchester
4,Anna,31,F,Liverpool

In [61]:
df.shape # ไม่ต้องใส่วงเล็บหลัง .shape เพราะเป็น attribute
# ผลออกมาจะเป็น (5row, 4column)

(5, 4)

In [62]:
# drop column city
df = df.drop('city', axis=1)# paramiter ตัวแรกคือcolumn ที่จะdrop และใส่ df = เพื่อเขียนทับ df เดิม

In [63]:
df # คอลัมน์ city จะหายไปแล้ว

,name,age,Gender
0,Toy,33,M
1,Joe,25,M
2,Marry,20,F
3,John,22,M
4,Anna,31,F

In [64]:
# remove index ที่ 2 (row ที่ 3)
df = df.drop(2, axis=0) # axis จริงๆไม่ต้องใส่ก็ได้
df # marry จะหายไปแล้ว

,name,age,Gender
0,Toy,33,M
1,Joe,25,M
3,John,22,M
4,Anna,31,F

In [65]:
# reset index
df = df.reset_index(drop=True) # ก็คือทำให้index เรียงใหม่จาก 0 1 3 4 -> 0 1 2 3 ตามปกติ
df

,name,age,Gender
0,Toy,33,M
1,Joe,25,M
2,John,22,M
3,Anna,31,F

In [66]:
# เรียกดูจำนวน row*column
df.shape

(4, 3)

In [67]:
# column names
df.columns

Index(['name', 'age', 'Gender'], dtype='object')

In [68]:
list(df.columns) # convert to list

['name', 'age', 'Gender']

In [69]:
# rename column
df.columns = ['nickname','age','sex']
df

,nickname,age,sex
0,Toy,33,M
1,Joe,25,M
2,John,22,M
3,Anna,31,F

In [70]:
print(df['nickname'])
print(type(df['nickname'])) # ถ้าแยก dataframe ออกมาเป็น 1 column คือ 1 series

0     Toy
1     Joe
2    John
3    Anna
Name: nickname, dtype: object
<class 'pandas.core.series.Series'>

In [71]:
# create a new series
s1 = pd.Series(['Marry', 20 ,'F'], index=['nickname','age','sex'])
print(s1) # paramiter แรกจะเป็น list นี่จะเป็นค่าในตาราง และ index จะเป็นชื่อแถว
print(type(s1))

nickname    Marry
age            20
sex             F
dtype: object
<class 'pandas.core.series.Series'>

In [72]:
# append
df = df.append(s1, ignore_index=True)
df
# นำ series เปลี่ยนเป็น row แล้วไปต่อท้าย dataframes ที่ชื่อว่า df

,nickname,age,sex
0,Toy,33,M
1,Joe,25,M
2,John,22,M
3,Anna,31,F
4,Marry,20,F

In [73]:
# create new column
s2 = pd.Series(['London','London','London','Manchester','Liverpool'])
df['city'] = s2
df

,nickname,age,sex,city
0,Toy,33,M,London
1,Joe,25,M,London
2,John,22,M,London
3,Anna,31,F,Manchester
4,Marry,20,F,Liverpool

In [75]:
# write csv file
df.to_csv('mydata.csv')

# เอา dataframe ที่เราทำไว้ใน python ออกมาเป็นไฟล์ csv
# แล้วไปดูที่ attached data (ด้านซ้ายมือสุดที่เป็นรูปคลิปหนีบกระดาษ)

In [76]:
# import csv file
df2 = pd.read_csv('data/data.csv')
df2

,id,name,city
0,1,John,London
1,2,Joe,Liverpool
2,3,Mary,Manchester
3,4,Anna,Swansea
4,5,David,London

In [2]:
# import excel file
import pandas as pd
df3 = pd.read_excel('data/data.xlsx')

In [2]:
df3

,id,name,city
0,1,John,London
1,2,Joe,Liverpool
2,3,Mary,Manchester
3,4,Anna,Swansea
4,5,David,London

# JavaScript Object Notation

In [5]:
# import json
df4 = pd.read_json('data/data.json')
df4

# list ที่เห็นจะกลายเป็น value ในแต่ละ column(key) นั้นๆนั่นเอง
# boolean ในไฟล์ json true และ false จะเป็นตัวพิมพ์เล็กหมดเลย

,ebook,language,amazonRating,myFavorite
0,Getting started with Python,python,4.89,True
1,Introduction to R,r,4.88,False
2,SQL for Beginners,sql,4.75,True

In [6]:
df4['myFavorite'].dtype # เช็ค data type ในคอลัมน์ myFavorite

dtype('bool')